In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([1,2,3,4])
s2 = pd.Series([11,23,31,41])

pd.concat([s1,s2])

0     1
1     2
2     3
3     4
0    11
1    23
2    31
3    41
dtype: int64

In [8]:
var1 = pd.DataFrame(
    {
        "A" : [1,2,3,4],
        "B" : [11,12,13,14],
    }
)
var2= pd.DataFrame(
    {
        "A" : [1,2,3,4],
        "C" : [21,22,23,24],
    }
)
pd.concat([var1,var2])
# pd.concat([var1,var2],"axis=0")

   A     B     c
0  1  11.0   NaN
1  2  12.0   NaN
2  3  13.0   NaN
3  4  14.0   NaN
0  1   NaN  21.0
1  2   NaN  22.0
2  3   NaN  23.0
3  4   NaN  24.0

In [9]:
pd.concat([var1,var2],axis=1)

   A   B  A   c
0  1  11  1  21
1  2  12  2  22
2  3  13  3  23
3  4  14  4  24

In [12]:
var1 = pd.DataFrame(
    {
        "A" : [1,2,3,4],
        "B" : [11,12,13,14],
    }
)
var2= pd.DataFrame(
    {
        "A" : [1,2],
        "C" : [21,22],
    }
)
pd.concat([var1,var2],axis=1)

   A   B    A     C
0  1  11  1.0  21.0
1  2  12  2.0  22.0
2  3  13  NaN   NaN
3  4  14  NaN   NaN

In [16]:
pd.concat([var1,var2],axis=1,join= "outer")

   A   B    A     C
0  1  11  1.0  21.0
1  2  12  2.0  22.0
2  3  13  NaN   NaN
3  4  14  NaN   NaN

In [17]:
pd.concat([var1,var2],axis=1,join= "inner")

   A   B  A   C
0  1  11  1  21
1  2  12  2  22

In [19]:
pd.concat([var1,var2],axis=0,keys=["D1","D2"])

      A     B     C
D1 0  1  11.0   NaN
   1  2  12.0   NaN
   2  3  13.0   NaN
   3  4  14.0   NaN
D2 0  1   NaN  21.0
   1  2   NaN  22.0

In [20]:
pd.concat([var1,var2],axis=1,keys=["D1","D2"])

  D1       D2
   A   B    A     C
0  1  11  1.0  21.0
1  2  12  2.0  22.0
2  3  13  NaN   NaN
3  4  14  NaN   NaN